In [1]:
import pandas as pd

In [3]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
pd.Series([7,8,66,4,5])

0     7
1     8
2    66
3     4
4     5
dtype: int64

In [5]:
seri=pd.Series([7,8,66,4,5])

In [6]:
type(seri)

pandas.core.series.Series

In [7]:
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [8]:
seri.dtype

dtype('int64')

In [9]:
seri.size

5

In [10]:
seri.ndim

1

In [11]:
seri.values

array([ 7,  8, 66,  4,  5], dtype=int64)

In [13]:
seri.head

<bound method NDFrame.head of 0     7
1     8
2    66
3     4
4     5
dtype: int64>

In [14]:
seri.head(3)

0     7
1     8
2    66
dtype: int64

In [15]:
seri.tail(3)

2    66
3     4
4     5
dtype: int64

In [16]:
pd.Series([99,22,332,94,5])

0     99
1     22
2    332
3     94
4      5
dtype: int64

In [17]:
pd.Series([99,22,332,94,5],index=[1,3,5,7,9])

1     99
3     22
5    332
7     94
9      5
dtype: int64

In [23]:
seri=pd.Series([99,22,332,94,5],index=["a","b","c","d","e"])

In [24]:
seri["a"]

99

In [25]:
seri["a":"c"]

a     99
b     22
c    332
dtype: int64

In [26]:
#sozluk liste

In [27]:
sozluk=pd.Series({"reg":10,"log":11,"cart":12})

In [28]:
sozluk

reg     10
log     11
cart    12
dtype: int64

In [29]:
#2 seri birl

In [30]:
pd.concat([seri,seri])

a     99
b     22
c    332
d     94
e      5
a     99
b     22
c    332
d     94
e      5
dtype: int64

In [31]:
#eleman i≈ü

In [36]:
import numpy as np

In [37]:
a=np.array([1,2,3,47,565])
seri=pd.Series(a)
seri

0      1
1      2
2      3
3     47
4    565
dtype: int32

In [38]:
seri[0]

1

In [39]:
seri[0:3]

0    1
1    2
2    3
dtype: int32

In [42]:
seri=pd.Series([121,200,150,99]
                ,index=["reg","loj","cart","rf"])
seri

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [43]:
seri.index

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [44]:
seri.keys

<bound method Series.keys of reg     121
loj     200
cart    150
rf       99
dtype: int64>

In [45]:
list(seri.items())

[('reg', 121), ('loj', 200), ('cart', 150), ('rf', 99)]

In [46]:
seri.values

array([121, 200, 150,  99], dtype=int64)

In [47]:
#eleman sorgulama

In [48]:
"reg" in seri

True

In [49]:
"aq" in seri

False

In [50]:
seri["reg"]

121

In [52]:
seri[["rf","reg"]]

rf      99
reg    121
dtype: int64

In [53]:
seri["reg"]=130

In [54]:
seri["reg"]

130

In [55]:
seri["reg":"loj"]

reg    130
loj    200
dtype: int64

In [56]:
 #pandas dataframe

In [57]:
l=[1,2,39,67,90]

In [58]:
l

[1, 2, 39, 67, 90]

In [59]:
pd.DataFrame(l,columns=["degisken_ismi"])

   degisken_ismi
0              1
1              2
2             39
3             67
4             90

In [60]:
m=np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [65]:
pd.DataFrame(m,columns=["var1","var1","var3"])

   var1  var1  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [67]:
df=pd.DataFrame(m,columns=["var1","var1","var3"])
df.head()

   var1  var1  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [68]:
df.columns

Index(['var1', 'var1', 'var3'], dtype='object')

In [70]:
df.columns=("deg1","deg2","deg3")
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [71]:
type(df)

pandas.core.frame.DataFrame

In [72]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [73]:
df.shape

(3, 3)

In [74]:
df.ndim

2

In [75]:
df.size

9

In [77]:
type(df.values)

numpy.ndarray

In [79]:
df.head()

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [81]:
df.tail(1)

   deg1  deg2  deg3
2     7     8     9

In [82]:
a=np.array([1,2,3,4,5])

In [83]:
pd.DataFrame(a,columns=["deg1"])

   deg1
0     1
1     2
2     3
3     4
4     5

In [3]:
import numpy as np

In [4]:
import pandas as pd

In [5]:
m=np.random.randint(1,30,size=(10,3))

In [6]:
df=pd.DataFrame(m,columns=["var1","var2","var3"])

In [8]:
df

   var1  var2  var3
0    22    10    26
1    18    24     4
2    14     2    12
3    28     2     9
4    27    27     7
5     8    20    21
6    14    22    11
7     3    25    20
8    14     6    11
9    17    11    18

In [9]:
df["var1"]

0    22
1    18
2    14
3    28
4    27
5     8
6    14
7     3
8    14
9    17
Name: var1, dtype: int32

In [10]:
df["var1"][0:2]

0    22
1    18
Name: var1, dtype: int32

In [11]:
df[0:2]

   var1  var2  var3
0    22    10    26
1    18    24     4

In [12]:
df[0:2][["var1","var2"]]

   var1  var2
0    22    10
1    18    24

In [13]:
df.var1

0    22
1    18
2    14
3    28
4    27
5     8
6    14
7     3
8    14
9    17
Name: var1, dtype: int32

In [15]:
df[df.var1>15]["var1"]

0    22
1    18
3    28
4    27
9    17
Name: var1, dtype: int32

In [16]:
df[df.var1>20]

   var1  var2  var3
0    22    10    26
3    28     2     9
4    27    27     7

In [17]:
df[(df.var1>15)&(df.var3<5)]

   var1  var2  var3
1    18    24     4

In [19]:
df.loc[(df.var1>15),["var1","var2"]]

   var1  var2
0    22    10
1    18    24
3    28     2
4    27    27
9    17    11

In [23]:
df[(df.var1>15)][["var1","var2"]]

   var1  var2
0    22    10
1    18    24
3    28     2
4    27    27
9    17    11

In [24]:
df

   var1  var2  var3
0    22    10    26
1    18    24     4
2    14     2    12
3    28     2     9
4    27    27     7
5     8    20    21
6    14    22    11
7     3    25    20
8    14     6    11
9    17    11    18

In [26]:
m=np.random.randint(1,30,size=(5,3))

In [29]:
df1=pd.DataFrame(m,columns=["var1","var2","var3"])

In [30]:
df1

   var1  var2  var3
0    10    26     3
1    21     3    12
2    10     7     2
3     8    29     2
4    22     1    29

In [32]:
df2=df1+99

In [33]:
df2

   var1  var2  var3
0   109   125   102
1   120   102   111
2   109   106   101
3   107   128   101
4   121   100   128

In [34]:
pd.concat([df1,df2])

   var1  var2  var3
0    10    26     3
1    21     3    12
2    10     7     2
3     8    29     2
4    22     1    29
0   109   125   102
1   120   102   111
2   109   106   101
3   107   128   101
4   121   100   128

In [35]:
?pd.concat

Signature:
pd.concat(
    objs: Union[Iterable[Union[ForwardRef('DataFrame'), ForwardRef('Series')]], Mapping[Union[Hashable, NoneType], Union[ForwardRef('DataFrame'), ForwardRef('Series')]]],
    axis=0,
    join='outer',
    ignore_index: bool = False,
    keys=None,
    levels=None,
    names=None,
    verify_integrity: bool = False,
    sort: bool = False,
    copy: bool = True,
) -> Union[ForwardRef('DataFrame'), ForwardRef('Series')]
Docstring:
Concatenate pandas objects along a particular axis with optional set logic
along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis,
which may be useful if the labels are the same (or overlapping) on
the passed axis number.

Parameters
----------
objs : a sequence or mapping of Series or DataFrame objects
    If a dict is passed, the sorted keys will be used as the `keys`
    argument, unless it is passed, in which case the values will be
    selected (see below). Any None objects will be dropped silently unless
    they are all None in which case a ValueError will be raised.
axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along.
join : {'inner', 'outer'}, default 'outer'
    How to handle indexes on other axis (or axes).
ignore_index : bool, default False
    If True, do not use the index values along the concatenation axis. The
    resulting axis will be labeled 0, ..., n - 1. This is useful if you are
    concatenating objects where the concatenation axis does not have
    meaningful indexing information. Note the index values on the other
    axes are still respected in the join.
keys : sequence, default None
    If multiple levels passed, should contain tuples. Construct
    hierarchical index using the passed keys as the outermost level.
levels : list of sequences, default None
    Specific levels (unique values) to use for constructing a
    MultiIndex. Otherwise they will be inferred from the keys.
names : list, default None
    Names for the levels in the resulting hierarchical index.
verify_integrity : bool, default False
    Check whether the new concatenated axis contains duplicates. This can
    be very expensive relative to the actual data concatenation.
sort : bool, default False
    Sort non-concatenation axis if it is not already aligned when `join`
    is 'outer'.
    This has no effect when ``join='inner'``, which already preserves
    the order of the non-concatenation axis.

    .. versionadded:: 0.23.0
    .. versionchanged:: 1.0.0

       Changed to not sort by default.

copy : bool, default True
    If False, do not copy data unnecessarily.

Returns
-------
object, type of objs
    When concatenating all ``Series`` along the index (axis=0), a
    ``Series`` is returned. When ``objs`` contains at least one
    ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
    the columns (axis=1), a ``DataFrame`` is returned.

See Also
--------
Series.append : Concatenate Series.
DataFrame.append : Concatenate DataFrames.
DataFrame.join : Join DataFrames using indexes.
DataFrame.merge : Merge DataFrames by indexes or columns.

Notes
-----
The keys, levels, and names arguments are all optional.

A walkthrough of how this method fits in with other tools for combining
pandas objects can be found `here
<https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

Examples
--------
Combine two ``Series``.

>>> s1 = pd.Series(['a', 'b'])
>>> s2 = pd.Series(['c', 'd'])
>>> pd.concat([s1, s2])
0    a
1    b
0    c
1    d
dtype: object

Clear the existing index and reset it in the result
by setting the ``ignore_index`` option to ``True``.

>>> pd.concat([s1, s2], ignore_index=True)
0    a
1    b
2    c
3    d
dtype: object

Add a hierarchical index at the outermost level of
the data with the ``keys`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'])
s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

Label the index keys you create with the ``names`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])
Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

Combine two ``DataFrame`` objects with identical columns.

>>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
>>> df1
  letter  number
0      a       1
1      b       2
>>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])
>>> df2
  letter  number
0      c       3
1      d       4
>>> pd.concat([df1, df2])
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects with overlapping columns
and return everything. Columns outside the intersection will
be filled with ``NaN`` values.

>>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
>>> df3
  letter  number animal
0      c       3    cat
1      d       4    dog
>>> pd.concat([df1, df3], sort=False)
  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

Combine ``DataFrame`` objects with overlapping columns
and return only those that are shared by passing ``inner`` to
the ``join`` keyword argument.

>>> pd.concat([df1, df3], join="inner")
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects horizontally along the x axis by
passing in ``axis=1``.

>>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
...                    columns=['animal', 'name'])
>>> pd.concat([df1, df4], axis=1)
  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

Prevent the result from including duplicate index values with the
``verify_integrity`` option.

>>> df5 = pd.DataFrame([1], index=['a'])
>>> df5
   0
a  1
>>> df6 = pd.DataFrame([2], index=['a'])
>>> df6
   0
a  2
>>> pd.concat([df5, df6], verify_integrity=True)
Traceback (most recent call last):
    ...
ValueError: Indexes have overlapping values: ['a']
File:      c:\users\seevv\anaconda3\lib\site-packages\pandas\core\reshape\concat.py
Type:      function

In [38]:
pd.concat([df1,df2],ignore_index=True)

   var1  var2  var3
0    10    26     3
1    21     3    12
2    10     7     2
3     8    29     2
4    22     1    29
5   109   125   102
6   120   102   111
7   109   106   101
8   107   128   101
9   121   100   128

In [40]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [41]:
df2.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [43]:
df2.columns=["var1","var2","deg3"]

In [44]:
df2

   var1  var2  deg3
0   109   125   102
1   120   102   111
2   109   106   101
3   107   128   101
4   121   100   128

In [45]:
df1

   var1  var2  var3
0    10    26     3
1    21     3    12
2    10     7     2
3     8    29     2
4    22     1    29

In [46]:
pd.concat([df1,df2])

   var1  var2  var3   deg3
0    10    26   3.0    NaN
1    21     3  12.0    NaN
2    10     7   2.0    NaN
3     8    29   2.0    NaN
4    22     1  29.0    NaN
0   109   125   NaN  102.0
1   120   102   NaN  111.0
2   109   106   NaN  101.0
3   107   128   NaN  101.0
4   121   100   NaN  128.0

In [48]:
pd.concat([df1,df2],join="inner")

   var1  var2
0    10    26
1    21     3
2    10     7
3     8    29
4    22     1
0   109   125
1   120   102
2   109   106
3   107   128
4   121   100

In [56]:
pd.concat([df1,df2],join_axes=[df1.columns])
# join_axes deprecated since pandas 1.0.0

TypeError: concat() got an unexpected keyword argument 'join__axes'

In [62]:
df1=pd.DataFrame({'calisanlar':['Ali','Veli','Ayse','Fatma'],
               'grup':['Muhasebe','Muhendislik','Muhendislik','ƒ∞K']})
            
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           ƒ∞K

In [63]:
df2=pd.DataFrame({'calisanlar':['Ali','Veli','Ayse','Fatma'],
                  'ilk_giris':[2020,2009,2014,2019]})
df2

  calisanlar  ilk_giris
0        Ali       2020
1       Veli       2009
2       Ayse       2014
3      Fatma       2019

In [64]:
pd.merge(df1,df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2020
1       Veli  Muhendislik       2009
2       Ayse  Muhendislik       2014
3      Fatma           ƒ∞K       2019

In [65]:
pd.merge(df1,df2,on="calisanlar")

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2020
1       Veli  Muhendislik       2009
2       Ayse  Muhendislik       2014
3      Fatma           ƒ∞K       2019

In [68]:
#√ßoktan teke

In [69]:
df3=pd.merge(df1,df2)

In [70]:
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2020
1       Veli  Muhendislik       2009
2       Ayse  Muhendislik       2014
3      Fatma           ƒ∞K       2019

In [72]:
df4=pd.DataFrame({'grup':['Muhasebe','Muhendislik','ƒ∞K'],
                  'mudur':['Caner','Mustafa','Berkcan']})
df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           ƒ∞K  Berkcan

In [73]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2020    Caner
1       Veli  Muhendislik       2009  Mustafa
2       Ayse  Muhendislik       2014  Mustafa
3      Fatma           ƒ∞K       2019  Berkcan

In [74]:
# TOPLULA≈ûTIRMA VE GRUPLAMA

In [75]:
#BASƒ∞T TOPLULA≈ûTIRMA FONK

In [77]:
import seaborn as sns

In [80]:
df=sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [81]:
df.shape

(1035, 6)

In [82]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [83]:
df["mass"].mean()

2.6381605847953233

In [84]:
df["mass"].max

<bound method Series.max of 0        7.10
1        2.21
2        2.60
3       19.40
4       10.50
        ...
1030      NaN
1031      NaN
1032      NaN
1033      NaN
1034      NaN
Name: mass, Length: 1035, dtype: float64>

In [85]:
df["mass"].var()

14.58183312700122

In [86]:
df["mass"].count()

513

In [87]:
df["mass"].sum()

1353.37638

In [88]:
df["mass"].min()

0.0036

In [90]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [91]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

In [92]:
df=pd.DataFrame({'gruplar':['A','B','C','A','B','C'],
                'veri':[10,11,52,23,43,55]},columns=['gruplar','veri'])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [94]:
df.groupby("gruplar")

In [125]:
df=pd.DataFrame({'gruplar':['A','B','C','A','B','C'],
                'degisken1':[10,23,33,22,11,99],
                'degisken2':[1000,253,333,262,111,969]},
                columns=['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10       1000
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [100]:
#aggregate

In [102]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A               16        631
B               17        132
C               66        651

In [104]:
df.groupby("gruplar").aggregate(["min",np.median,max])

        degisken1            degisken2
              min median max       min median   max
gruplar
A              10     16  22       262    631  1000
B              11     17  23        11    132   253
C              33     66  99       333    651   969

In [107]:
df.groupby("gruplar").aggregate({"degisken1":"min"})

         degisken1
gruplar
A               10
B               11
C               33

In [108]:
df

  gruplar  degisken1  degisken2
0       A         10       1000
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11         11
5       C         99        969

In [110]:
def filter_func(x):
    return x["degisken1"].std()>9

In [112]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
A         8.485281  521.844805
B         8.485281  171.119841
C        46.669048  449.719913

In [111]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

In [114]:
df["degisken1"]*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: degisken1, dtype: int64

In [128]:
df_a=df.iloc[:,1:3]

In [129]:
df_a.transform(lambda x: x-x.mean())

   degisken1  degisken2
0      -23.0      512.0
1      -10.0     -235.0
2        0.0     -155.0
3      -11.0     -226.0
4      -22.0     -377.0
5       66.0      481.0

In [130]:
df_a.transform(lambda x: (x-x.mean())/x.std())

   degisken1  degisken2
0  -0.687871   1.308133
1  -0.299074  -0.600413
2   0.000000  -0.396017
3  -0.328982  -0.577418
4  -0.657963  -0.963215
5   1.973890   1.228930

In [131]:
#apply

In [133]:
 df.apply(np.sum)

gruplar      ABCABC
degisken1       198
degisken2      2928
dtype: object

In [137]:
df=pd.DataFrame({'degisken1':[10,23,33,22,11,99],
                'degisken2':[1000,253,333,262,111,969]},
                columns=['degisken1','degisken2'])
df

   degisken1  degisken2
0         10       1000
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [144]:
df=pd.DataFrame({'gruplar':['A','B','C','A','B','C'],
                'degisken1':[10,23,33,22,11,99],
                'degisken2':[1000,253,333,262,111,969]},
                columns=['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10       1000
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [138]:
df.apply(np.mean)

degisken1     33.0
degisken2    488.0
dtype: float64

In [145]:
df.groupby("gruplar").apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         32       1262
B            BB         34        364
C            CC        132       1302

In [148]:
titanic=sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [149]:
titanic.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [151]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [152]:
#pivot table

In [153]:
titanic.pivot_table("survived",index="sex",columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [154]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [156]:
age=pd.cut(titanic["age"],[0,18,90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [160]:
titanic.pivot_table("survived",["sex",age],"class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

In [ ]:
#csv okuma

In [163]:
pd.read_csv("reading_data/ornekcsv.csv",sep=";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [166]:
#txt
pd.read_csv("reading_data/duz_metin.txt")

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [168]:
pd.read_excel("reading_data/ornekx.xlsx")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [169]:
df.columns=("A","B","C")
df

   A   B     C
0  A  10  1000
1  B  23   253
2  C  33   333
3  A  22   262
4  B  11   111
5  C  99   969

In [170]:
tips=pd.read_csv("reading_data/data.txt")

In [171]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [172]:
#dokuman okuma